package com.wx.demo.bean;

import com.wx.demo.frameWork.client.grpcClient.IpadApplication;

public class logo {
   public static String logo = "\n\n\n" +
           "\t_______________________________________________________\n" +
           "\t\\\\                    _ooOoo_                        //\n" +
           "\t\\\\                  o888888888o                      //\n" +
           "\t\\\\                 888\"  .  \"888                     //\n" +
           "\t\\\\                 (|   ^_^   |)                     //\n" +
           "\t\\\\                  O\\   =   /O                      //\n" +
           "\t\\\\                ____/`---'\\____                    //\n" +
           "\t\\\\              .'  \\\\|     |//  `.                  //\n" +
           "\t\\\\             /  \\\\|||  :  |||//  \\                 //\n" +
           "\t\\\\            /  _||||| -:- |||||-  \\                //\n" +
           "\t\\\\            |   | \\\\\\  -  /// |   |                //\n" +
           "\t\\\\            | \\_|  ''\\---/''  |   |                //\n" +
           "\t\\\\            \\  .-\\__  `-`  ___/-. /                //\n" +
           "\t\\\\          ___`. .'  /--.--\\  `. . ___              //\n" +
           "\t\\\\        .\"\" '<  `.___\\_<|>_/___.'  >'\"\".           //\n" +
           "\t\\\\      | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |          //\n" +
           "\t\\\\      \\  \\ `-.   \\_ __\\ /__ _/   .-` /  /          //\n" +
           "\t\\\\========`-.____`-.___\\_____/___.-`____.-'==========//\n" +
           "\t \\   佛祖保佑           `=---='         永不宕机       /\n" +
           "\t  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ \n" +
           "\t---------------------服务器已启动-----------------------\n\t" +
           "\t[当前状态]:  {}™接口服务\t[正在工作中] \n\t" +
           "\t[  GRPC ]: \t连接池有效链接数\t[ "+(IpadApplication.getInstance().getTotalClientNum() +1)+"  ] \n\t" +
           "\t[  GRPC ]: \t是否启用SSL/TLS\t["+ true +" ] \n\t" +
           "\t[  API  ]: \t连接池有效链接数\t[ 01  ] \n\t" +
           "\t[  API  ]: \t是否启用SSL/TLS\t["+ false +"] \n\t" +
           "\t[监听接口]: \thttp://localhost:{}\n\t" +
           "\t[外部接口]: \thttp://{}:{}\n\t"+
           "\t[文件接口]: \thttp://{}:{}/doc.html\n\t"+
           "\t[本地访问]: \thttp://localhost:{}/doc.html\n\t"+
           "\t[外网访问]: \thttp://{}:{}/doc.html\n\t"+
           "\t[服务编号]: \t[{}] \n\t"+

           "------------------------------------------------------";



}
